app/Controllers/ControllerRisorse.php

SELECT *
FROM `risorse`
WHERE `tipo` = 'laboratorio'
---
    public function risorsePerTipo($tipo = null)
    {
        $model = new \App\Models\ModelloRisorse();

        if ($tipo === 'dispositivi') {
            $risorse = $model->whereIn('tipo', ['PC', 'stampante', 'proiettore'])->findAll();
        } else {
            $risorse = $model->where('tipo', $tipo)->findAll();